# Задача №3
#3. Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

# Первый вариант решения через list.
a = int(input("Введите номер любого месяца: "))
times = ["Зима", "Весна", "Лето", "Осень"]
if a == 1 or a == 2 or a == 12:
    print(times[0])
elif a == 3 or a == 4 or a == 5:
    print(times[1])
elif a == 6 or a == 7 or a == 8:
    print(times[2])
elif a == 9 or a == 10 or a == 11:
    print(times[3])
else:
    print("Месяца с таким номером нет!")


# Второй вариант решения через dict.
b = int(input("Введите номер любого месяца от 1 до 12: "))
a = {"01": "Зима", "02": "Весна","03": "Лето", "04": "Осень", }
if b == 1 or b == 2 or b ==12:
    print(a["01"])
elif b == 3 or b == 4 or b == 5:
    print(a["02"])
elif b == 6 or b == 7 or b == 8:
    print(a["03"])
elif b == 9 or b == 10 or b ==11:
    print(a["04"])
else:
    print("Месяца с таким номером нет!")

